
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	ЗаполнитьРасписаниеНаСервере();  
	ОповеститьОбИзменении(ПараметрКоманды);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРасписаниеНаСервере()
	НачалоЭтойНедели = НачалоНедели(ТекущаяДатаСеанса());
	
	//Перебрать все дни этой недели
	Для КоличествоДобавляемыхДней = 0 По 4 Цикл
		ДатаСтарого = НачалоЭтойНедели + 60 * 60 *24 * КоличествоДобавляемыхДней;  
		НомерСтарого = Серверный.ПолучитьНомер(ДатаСтарого);
		
		СтарыйДокумент = Документы.УчебныйДень.НайтиПоНомеру(НомерСтарого);  
		
		Если СтарыйДокумент.Пустая() Тогда  
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "На " + Формат(ДатаСтарого, "ДФ='д ММММ гггг, дддд'") + " нет учебного дня.";
			Сообщение.Сообщить();
			Продолжить;			
		КонецЕсли; 
		ДатаНового = ДатаСтарого + 60 * 60 *24 * 7;
		НомерНового = Серверный.ПолучитьНомер(ДатаНового);
		
		Если Документы.УчебныйДень.НайтиПоНомеру(НомерНового).Пустая() Тогда
			НовыйДокумент = Документы.УчебныйДень.СоздатьДокумент();
			НовыйДокумент.Дата = ДатаНового;
			Для Каждого СтрокаСтарого Из СтарыйДокумент.Уроки Цикл
				НоваяСтрока = НовыйДокумент.Уроки.Добавить();
				НоваяСтрока.Предмет = СтрокаСтарого.Предмет;
			КонецЦикла;
			
			НовыйДокумент.Записать();
			
		Иначе 
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Уже есть учебный день " + Формат(ДатаНового, "ДФ='д ММММ гггг, дддд'");
			Сообщение.Сообщить();			
		КонецЕсли;
		
		
	КонецЦикла;
КонецПроцедуры
