
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Номер = Серверный.ПолучитьНомер(Дата);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	
	Движения.Оценки.Записывать = Истина;
	Движения.ПрошедшиеЗанятия.Записывать = Истина;
	Для Каждого ТекСтрокаУроки Из Уроки Цикл 
		// регистр Оценки
		Если ЗначениеЗаполнено(ТекСтрокаУроки.Оценка)Тогда 
			Движение = Движения.Оценки.Добавить();
			Движение.Период = Дата;
			Движение.Предмет = ТекСтрокаУроки.Предмет;
			Движение.НомерУрока = ТекСтрокаУроки.НомерСтроки;
			Движение.Оценка = ТекСтрокаУроки.Оценка; 
		КонецЕсли; 
		
		// регистр ПрошедшиеЗанятия
		Движение = Движения.ПрошедшиеЗанятия.Добавить();
		Движение.Период = Дата;
		Движение.Предмет =ТекСтрокаУроки.Предмет;
		Движение.КоличествоУроков = 1;
		
	КонецЦикла;
	
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	// Регистр ДомашниеЗадания
	НаборЗаписей = РегистрыСведений.ДомашниеЗадания.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(Ссылка);
	Для Каждого СтрокаТЧ из Уроки Цикл
		Если ЗначениеЗаполнено(СтрокаТЧ.ДомашнееЗадание) Тогда  
			НоваяЗапись = НаборЗаписей.Добавить();
			НоваяЗапись.Период = НачалоДня(Дата);
			НоваяЗапись.Предмет = СтрокаТЧ.Предмет;
			НоваяЗапись.ДомашнееЗадание = СтрокаТЧ.ДомашнееЗадание;
			НоваяЗапись.Выполнено = СтрокаТЧ.Выполнено;
			
		КонецЕсли;
	КонецЦикла;  
	НаборЗаписей.Записать();
	
КонецПроцедуры
